In [1]:
import pandas as pd
import numpy as np

In [2]:
main_dataset = pd.read_csv("practice_dataset1.csv")
print(main_dataset)

   id   name  age sex   salary   bmi  children smoker region department  \
0   1   John   28   M  55000.0  24.5       2.0    Yes  North      Sales
1   2   Jane   34   F  62000.0  22.1       1.0     No  South  Marketing
2   3    Bob   45   M  70000.0  27.8       3.0    Yes   East         IT
3   4  Alice   29   F  58000.0  23.4       0.0     No   West         HR
4   5   Mike   38   M  65000.0  28.2       NaN    Yes  North    Finance
5   6  Linda   31   F  60000.0  21.9       2.0     No  South         IT
6   7  Steve   42   M  72000.0  26.5       1.0    Yes   East  Marketing
7   8  Karen   36   F      NaN  24.9       2.0     No   West      Sales
8   9    Tom   39   M  68000.0  29.1       3.0    Yes  North    Finance
9  10  Susan   33   F  61000.0  23.0       1.0     No  South         HR

    join_date  is_manager
0  2020-01-15       False
1  2019-06-23        True
2  2015-09-10       False
3  2021-03-12       False
4  2018-12-01        True
5  2020-07-08       False
6  2016-11-20        True
7  2017-04-30       False
8  2015-05-14       False
9  2019-08-25       False

In [3]:
main_dataset1 = main_dataset.copy()
main_dataset2 = main_dataset.copy()
main_dataset3 = main_dataset.copy()
main_dataset4 = main_dataset.copy()
main_dataset5 = main_dataset.copy()
main_dataset6 = main_dataset.copy()
main_dataset7 = main_dataset.copy()
main_dataset8 = main_dataset.copy()
main_dataset9 = main_dataset.copy()

In [4]:
main_dataset.shape

(10, 12)

In [5]:
print(list(main_dataset.columns))

['id', 'name', 'age', 'sex', 'salary', 'bmi', 'children', 'smoker', 'region', 'department', 'join_date', 'is_manager']

In [6]:
main_dataset.index

RangeIndex(start=0, stop=10, step=1)

In [7]:
main_dataset.size

120

In [8]:
main_dataset.dtypes

id              int64
name           object
age             int64
sex            object
salary        float64
bmi           float64
children      float64
smoker         object
region         object
department     object
join_date      object
is_manager       bool
dtype: object

In [9]:
numeric_columns = main_dataset.select_dtypes(include='number')
print(numeric_columns)

   id  age   salary   bmi  children
0   1   28  55000.0  24.5       2.0
1   2   34  62000.0  22.1       1.0
2   3   45  70000.0  27.8       3.0
3   4   29  58000.0  23.4       0.0
4   5   38  65000.0  28.2       NaN
5   6   31  60000.0  21.9       2.0
6   7   42  72000.0  26.5       1.0
7   8   36      NaN  24.9       2.0
8   9   39  68000.0  29.1       3.0
9  10   33  61000.0  23.0       1.0

In [10]:
numeric_columns = main_dataset.select_dtypes(include='number').columns
print(numeric_columns)

Index(['id', 'age', 'salary', 'bmi', 'children'], dtype='object')

In [11]:
numeric_objects = main_dataset.select_dtypes(include='object')
print(numeric_objects)

    name sex smoker region department   join_date
0   John   M    Yes  North      Sales  2020-01-15
1   Jane   F     No  South  Marketing  2019-06-23
2    Bob   M    Yes   East         IT  2015-09-10
3  Alice   F     No   West         HR  2021-03-12
4   Mike   M    Yes  North    Finance  2018-12-01
5  Linda   F     No  South         IT  2020-07-08
6  Steve   M    Yes   East  Marketing  2016-11-20
7  Karen   F     No   West      Sales  2017-04-30
8    Tom   M    Yes  North    Finance  2015-05-14
9  Susan   F     No  South         HR  2019-08-25

In [12]:
numeric_objects = main_dataset.select_dtypes(include='object').columns
print(numeric_objects)

Index(['name', 'sex', 'smoker', 'region', 'department', 'join_date'], dtype='object')

In [13]:
print(main_dataset.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 12 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          10 non-null     int64
 1   name        10 non-null     object
 2   age         10 non-null     int64
 3   sex         10 non-null     object
 4   salary      9 non-null      float64
 5   bmi         10 non-null     float64
 6   children    9 non-null      float64
 7   smoker      10 non-null     object
 8   region      10 non-null     object
 9   department  10 non-null     object
 10  join_date   10 non-null     object
 11  is_manager  10 non-null     bool
dtypes: bool(1), float64(3), int64(2), object(6)
memory usage: 1022.0+ bytes
None

In [14]:
main_dataset['join_date'] = pd.to_datetime(main_dataset['join_date'])
print(main_dataset)

   id   name  age sex   salary   bmi  children smoker region department  \
0   1   John   28   M  55000.0  24.5       2.0    Yes  North      Sales
1   2   Jane   34   F  62000.0  22.1       1.0     No  South  Marketing
2   3    Bob   45   M  70000.0  27.8       3.0    Yes   East         IT
3   4  Alice   29   F  58000.0  23.4       0.0     No   West         HR
4   5   Mike   38   M  65000.0  28.2       NaN    Yes  North    Finance
5   6  Linda   31   F  60000.0  21.9       2.0     No  South         IT
6   7  Steve   42   M  72000.0  26.5       1.0    Yes   East  Marketing
7   8  Karen   36   F      NaN  24.9       2.0     No   West      Sales
8   9    Tom   39   M  68000.0  29.1       3.0    Yes  North    Finance
9  10  Susan   33   F  61000.0  23.0       1.0     No  South         HR

   join_date  is_manager
0 2020-01-15       False
1 2019-06-23        True
2 2015-09-10       False
3 2021-03-12       False
4 2018-12-01        True
5 2020-07-08       False
6 2016-11-20        True
7 2017-04-30       False
8 2015-05-14       False
9 2019-08-25       False

In [15]:
main_dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 12 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          10 non-null     int64
 1   name        10 non-null     object
 2   age         10 non-null     int64
 3   sex         10 non-null     object
 4   salary      9 non-null      float64
 5   bmi         10 non-null     float64
 6   children    9 non-null      float64
 7   smoker      10 non-null     object
 8   region      10 non-null     object
 9   department  10 non-null     object
 10  join_date   10 non-null     datetime64[ns]
 11  is_manager  10 non-null     bool
dtypes: bool(1), datetime64[ns](1), float64(3), int64(2), object(5)
memory usage: 1022.0+ bytes

In [16]:
for col in main_dataset:
    if main_dataset[col].dtype == 'object':
        print(f"{col}")

name
sex
smoker
region
department

In [17]:
main_dataset.select_dtypes(include='object').columns

Index(['name', 'sex', 'smoker', 'region', 'department'], dtype='object')

In [18]:
type(main_dataset)

pandas.core.frame.DataFrame

In [19]:
print(main_dataset.ndim)

2

In [20]:
main_dataset.values

array([[1, 'John', 28, 'M', 55000.0, 24.5, 2.0, 'Yes', 'North', 'Sales',
        Timestamp('2020-01-15 00:00:00'), False],
       [2, 'Jane', 34, 'F', 62000.0, 22.1, 1.0, 'No', 'South',
        'Marketing', Timestamp('2019-06-23 00:00:00'), True],
       [3, 'Bob', 45, 'M', 70000.0, 27.8, 3.0, 'Yes', 'East', 'IT',
        Timestamp('2015-09-10 00:00:00'), False],
       [4, 'Alice', 29, 'F', 58000.0, 23.4, 0.0, 'No', 'West', 'HR',
        Timestamp('2021-03-12 00:00:00'), False],
       [5, 'Mike', 38, 'M', 65000.0, 28.2, nan, 'Yes', 'North',
        'Finance', Timestamp('2018-12-01 00:00:00'), True],
       [6, 'Linda', 31, 'F', 60000.0, 21.9, 2.0, 'No', 'South', 'IT',
        Timestamp('2020-07-08 00:00:00'), False],
       [7, 'Steve', 42, 'M', 72000.0, 26.5, 1.0, 'Yes', 'East',
        'Marketing', Timestamp('2016-11-20 00:00:00'), True],
       [8, 'Karen', 36, 'F', nan, 24.9, 2.0, 'No', 'West', 'Sales',
        Timestamp('2017-04-30 00:00:00'), False],
       [9, 'Tom', 39, 'M', 68000.0, 29.1, 3.0, 'Yes', 'North', 'Finance',
        Timestamp('2015-05-14 00:00:00'), False],
       [10, 'Susan', 33, 'F', 61000.0, 23.0, 1.0, 'No', 'South', 'HR',
        Timestamp('2019-08-25 00:00:00'), False]], dtype=object)

In [21]:
main_dataset.T

,0,1,2,3,4,5,6,7,8,9
id,1,2,3,4,5,6,7,8,9,10
name,John,Jane,Bob,Alice,Mike,Linda,Steve,Karen,Tom,Susan
age,28,34,45,29,38,31,42,36,39,33
sex,M,F,M,F,M,F,M,F,M,F
salary,55000.0,62000.0,70000.0,58000.0,65000.0,60000.0,72000.0,NaN,68000.0,61000.0
bmi,24.5,22.1,27.8,23.4,28.2,21.9,26.5,24.9,29.1,23.0
children,2.0,1.0,3.0,0.0,NaN,2.0,1.0,2.0,3.0,1.0
smoker,Yes,No,Yes,No,Yes,No,Yes,No,Yes,No
region,North,South,East,West,North,South,East,West,North,South
department,Sales,Marketing,IT,HR,Finance,IT,Marketing,Sales,Finance,HR
join_date,2020-01-15 00:00:00,2019-06-23 00:00:00,2015-09-10 00:00:00,2021-03-12 00:00:00,2018-12-01 00:00:00,2020-07-08 00:00:00,2016-11-20 00:00:00,2017-04-30 00:00:00,2015-05-14 00:00:00,2019-08-25 00:00:00
is_manager,False,True,False,False,True,False,True,False,False,False

In [22]:
main_dataset.count()['id']

np.int64(10)

In [23]:
main_dataset.count()['salary'].mean()

np.float64(9.0)

In [24]:
main_dataset['salary'].mean()

np.float64(63444.444444444445)

In [25]:
main_dataset['salary'] = main_dataset['salary'].fillna(main_dataset['salary'].mean())
print(main_dataset)

   id   name  age sex        salary   bmi  children smoker region department  \
0   1   John   28   M  55000.000000  24.5       2.0    Yes  North      Sales
1   2   Jane   34   F  62000.000000  22.1       1.0     No  South  Marketing
2   3    Bob   45   M  70000.000000  27.8       3.0    Yes   East         IT
3   4  Alice   29   F  58000.000000  23.4       0.0     No   West         HR
4   5   Mike   38   M  65000.000000  28.2       NaN    Yes  North    Finance
5   6  Linda   31   F  60000.000000  21.9       2.0     No  South         IT
6   7  Steve   42   M  72000.000000  26.5       1.0    Yes   East  Marketing
7   8  Karen   36   F  63444.444444  24.9       2.0     No   West      Sales
8   9    Tom   39   M  68000.000000  29.1       3.0    Yes  North    Finance
9  10  Susan   33   F  61000.000000  23.0       1.0     No  South         HR

   join_date  is_manager
0 2020-01-15       False
1 2019-06-23        True
2 2015-09-10       False
3 2021-03-12       False
4 2018-12-01        True
5 2020-07-08       False
6 2016-11-20        True
7 2017-04-30       False
8 2015-05-14       False
9 2019-08-25       False

In [26]:
main_dataset['children'] = main_dataset['children'].fillna(main_dataset['children'].mean())
print(main_dataset)

   id   name  age sex        salary   bmi  children smoker region department  \
0   1   John   28   M  55000.000000  24.5  2.000000    Yes  North      Sales
1   2   Jane   34   F  62000.000000  22.1  1.000000     No  South  Marketing
2   3    Bob   45   M  70000.000000  27.8  3.000000    Yes   East         IT
3   4  Alice   29   F  58000.000000  23.4  0.000000     No   West         HR
4   5   Mike   38   M  65000.000000  28.2  1.666667    Yes  North    Finance
5   6  Linda   31   F  60000.000000  21.9  2.000000     No  South         IT
6   7  Steve   42   M  72000.000000  26.5  1.000000    Yes   East  Marketing
7   8  Karen   36   F  63444.444444  24.9  2.000000     No   West      Sales
8   9    Tom   39   M  68000.000000  29.1  3.000000    Yes  North    Finance
9  10  Susan   33   F  61000.000000  23.0  1.000000     No  South         HR

   join_date  is_manager
0 2020-01-15       False
1 2019-06-23        True
2 2015-09-10       False
3 2021-03-12       False
4 2018-12-01        True
5 2020-07-08       False
6 2016-11-20        True
7 2017-04-30       False
8 2015-05-14       False
9 2019-08-25       False

In [27]:
main_dataset['salary'].max()

np.float64(72000.0)

In [28]:
main_dataset['salary'].min()

np.float64(55000.0)

In [29]:
main_dataset1['children'].max()

np.float64(3.0)

In [30]:
main_dataset1['children'].min()

np.float64(0.0)

In [31]:
main_dataset1['children'].median()

np.float64(2.0)

In [32]:
main_dataset1['children'].quantile(.25)

np.float64(1.0)

In [33]:
main_dataset['age'].unique()

array([28, 34, 45, 29, 38, 31, 42, 36, 39, 33])

In [34]:
main_dataset['department'].unique()

array(['Sales', 'Marketing', 'IT', 'HR', 'Finance'], dtype=object)

In [35]:
main_dataset.nunique()

id            10
name          10
age           10
sex            2
salary        10
bmi           10
children       5
smoker         2
region         4
department     5
join_date     10
is_manager     2
dtype: int64

In [36]:
main_dataset.count()

id            10
name          10
age           10
sex           10
salary        10
bmi           10
children      10
smoker        10
region        10
department    10
join_date     10
is_manager    10
dtype: int64

In [37]:
main_dataset

,id,name,age,sex,salary,bmi,children,smoker,region,department,join_date,is_manager
0,1,John,28,M,55000.000000,24.5,2.000000,Yes,North,Sales,2020-01-15,False
1,2,Jane,34,F,62000.000000,22.1,1.000000,No,South,Marketing,2019-06-23,True
2,3,Bob,45,M,70000.000000,27.8,3.000000,Yes,East,IT,2015-09-10,False
3,4,Alice,29,F,58000.000000,23.4,0.000000,No,West,HR,2021-03-12,False
4,5,Mike,38,M,65000.000000,28.2,1.666667,Yes,North,Finance,2018-12-01,True
5,6,Linda,31,F,60000.000000,21.9,2.000000,No,South,IT,2020-07-08,False
6,7,Steve,42,M,72000.000000,26.5,1.000000,Yes,East,Marketing,2016-11-20,True
7,8,Karen,36,F,63444.444444,24.9,2.000000,No,West,Sales,2017-04-30,False
8,9,Tom,39,M,68000.000000,29.1,3.000000,Yes,North,Finance,2015-05-14,False
9,10,Susan,33,F,61000.000000,23.0,1.000000,No,South,HR,2019-08-25,False

In [38]:
main_dataset.value_counts()

id  name   age  sex  salary        bmi   children  smoker  region  department  join_date   is_manager
1   John   28   M    55000.000000  24.5  2.000000  Yes     North   Sales       2020-01-15  False         1
2   Jane   34   F    62000.000000  22.1  1.000000  No      South   Marketing   2019-06-23  True          1
3   Bob    45   M    70000.000000  27.8  3.000000  Yes     East    IT          2015-09-10  False         1
4   Alice  29   F    58000.000000  23.4  0.000000  No      West    HR          2021-03-12  False         1
5   Mike   38   M    65000.000000  28.2  1.666667  Yes     North   Finance     2018-12-01  True          1
6   Linda  31   F    60000.000000  21.9  2.000000  No      South   IT          2020-07-08  False         1
7   Steve  42   M    72000.000000  26.5  1.000000  Yes     East    Marketing   2016-11-20  True          1
8   Karen  36   F    63444.444444  24.9  2.000000  No      West    Sales       2017-04-30  False         1
9   Tom    39   M    68000.000000  29.1  3.000000  Yes     North   Finance     2015-05-14  False         1
10  Susan  33   F    61000.000000  23.0  1.000000  No      South   HR          2019-08-25  False         1
Name: count, dtype: int64

In [39]:
main_dataset.value_counts(normalize=True)

id  name   age  sex  salary        bmi   children  smoker  region  department  join_date   is_manager
1   John   28   M    55000.000000  24.5  2.000000  Yes     North   Sales       2020-01-15  False         0.1
2   Jane   34   F    62000.000000  22.1  1.000000  No      South   Marketing   2019-06-23  True          0.1
3   Bob    45   M    70000.000000  27.8  3.000000  Yes     East    IT          2015-09-10  False         0.1
4   Alice  29   F    58000.000000  23.4  0.000000  No      West    HR          2021-03-12  False         0.1
5   Mike   38   M    65000.000000  28.2  1.666667  Yes     North   Finance     2018-12-01  True          0.1
6   Linda  31   F    60000.000000  21.9  2.000000  No      South   IT          2020-07-08  False         0.1
7   Steve  42   M    72000.000000  26.5  1.000000  Yes     East    Marketing   2016-11-20  True          0.1
8   Karen  36   F    63444.444444  24.9  2.000000  No      West    Sales       2017-04-30  False         0.1
9   Tom    39   M    68000.000000  29.1  3.000000  Yes     North   Finance     2015-05-14  False         0.1
10  Susan  33   F    61000.000000  23.0  1.000000  No      South   HR          2019-08-25  False         0.1
Name: proportion, dtype: float64